---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FamilyKeyExtParam
source: html/0ee771b7-5e9b-7a5b-1ddb-5074bea0e5ab.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FamilyKeyExtParam Property

"Filter Parameter"

## Syntax (C#)
```csharp
public static ForgeTypeId FamilyKeyExtParam { get; }
```